; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pickup
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
(define (problem transport-35)
 (:domain transport)
 (:objects 
    v1 - vehicle
    p1 p2 p3 p4 p5 p6 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    c0 c1 c2 - size
    )
 (:init
    (capacity v1 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l1)
    (at p3 l7)
    (at p4 l4)
    (at p5 l5)
    (at p6 l5)
    (at v1 l8)
    (road l6 l2)
    (road l7 l1)
    (road l9 l3)
    (road l8 l1)
    (road l4 l9)
    (road l1 l8)
    (road l9 l2)
    (road l7 l9)
    (road l2 l9)
    (road l1 l7)
    (road l3 l9)
    (road l2 l6)
    (road l5 l3)
    (road l9 l7)
    (road l3 l5)
    (road l9 l4)
    (road l1 l9)
    (road l9 l1)
    (road l2 l5)
    (road l5 l2)
    (road l2 l8)
    (road l8 l2)
    (road l4 l5)
    (road l5 l4)
    )
 (:goal  (and 
    (at p1 l7)
    (at p2 l4)
    (at p3 l8)
    (at p4 l6)
    (at p5 l7)
    (at p6 l3))))

; plan
1. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 0 of 6
2. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 0 of 6
3. (pickup v1 l5 p1 c1 c2)
   deleted: (at p1 l5) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 6
4. (drive v1 l5 l3)
   deleted: (at v1 l5)
   added: (at v1 l3)
   goals met: 0 of 6
5. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 0 of 6
6. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 0 of 6
7. (drop v1 l7 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l7) (capacity v1 c2)
   goals met: 1 of 6
8. (drive v1 l7 l1)
   deleted: (at v1 l7)
   added: (at v1 l1)
   goals met: 1 of 6
9. (pickup v1 l1 p2 c1 c2)
   deleted: (at p2 l1) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 6
10. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 1 of 6
11. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 1 of 6
12. (drop v1 l4 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l4) (capacity v1 c2)
   goals met: 2 of 6
13. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 2 of 6
14. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 2 of 6
15. (pickup v1 l7 p3 c1 c2)
   deleted: (at p3 l7) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 6
16. (drive v1 l7 l1)
   deleted: (at v1 l7)
   added: (at v1 l1)
   goals met: 2 of 6
17. (drive v1 l1 l8)
   deleted: (at v1 l1)
   added: (at v1 l8)
   goals met: 2 of 6
18. (drop v1 l8 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l8) (capacity v1 c2)
   goals met: 3 of 6
19. (drive v1 l8 l1)
   deleted: (at v1 l8)
   added: (at v1 l1)
   goals met: 3 of 6
20. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 3 of 6
21. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 3 of 6
22. (pickup v1 l4 p4 c1 c2)
   deleted: (at p4 l4) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 6
23. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 3 of 6
24. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 3 of 6
25. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 3 of 6
26. (drop v1 l6 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l6) (capacity v1 c2)
   goals met: 4 of 6
27. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 4 of 6
28. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 4 of 6
29. (pickup v1 l5 p5 c1 c2)
   deleted: (at p5 l5) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 6
30. (drive v1 l5 l3)
   deleted: (at v1 l5)
   added: (at v1 l3)
   goals met: 4 of 6
31. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 4 of 6
32. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 4 of 6
33. (drop v1 l7 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l7) (capacity v1 c2)
   goals met: 5 of 6
34. (drive v1 l7 l9)
   deleted: (at v1 l7)
   added: (at v1 l9)
   goals met: 5 of 6
35. (drive v1 l9 l3)
   deleted: (at v1 l9)
   added: (at v1 l3)
   goals met: 5 of 6
36. (drive v1 l3 l5)
   deleted: (at v1 l3)
   added: (at v1 l5)
   goals met: 5 of 6
37. (pickup v1 l5 p6 c1 c2)
   deleted: (at p6 l5) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 6
38. (drive v1 l5 l3)
   deleted: (at v1 l5)
   added: (at v1 l3)
   goals met: 5 of 6
39. (drop v1 l3 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l3) (capacity v1 c2)
   goals met: 6 of 6
